# VertexFormat Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexFormat Methods
VertexFormat Class See Also
---
The VertexFormat type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValid | Tests whether the vertex format specification is valid for rendering. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace